app/controllers/employees_controller.rb

  def index
    if !Current.user
        redirect_to login_path, alert: "You must be signed in to do that."
    else
        @employee = Employee.all
---
SELECT "employees".* FROM "employees"

  def create
    @employee = Employee.new(employee_params)

    if @employee.save
---
INSERT INTO "employees" ("first_name", "last_name", "email", "number", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"

  def destroy
    @employee = Employee.find_by(id: params[:id])
    if @employee.destroy
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "employees" WHERE "employees"."id" = ?  [["id", 1]]

  def edit
    @employee = Employee.find_by(id: params[:id])
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @employee = Employee.find_by(id: params[:id])
    if @employee.update(employee_params)
---
SELECT "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "employees" SET "number" = ?, "updated_at" = ? WHERE "employees"."id" = ?  [["number", 1782929341], ["updated_at", "2023-12-08 10:02:34.982703"], ["id", 1]]