app/controllers/employee_backups_controller.rb

  def index
    @employee_backups = EmployeeBackup.all
---
SELECT "employee_backups".* FROM "employee_backups"